utilFiles/initFiles/init.org
#+title: Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes


* Basic UI Configuration

#+begin_src emacs-lisp

    ;; You will most likely need to adjust this font size for your system!
    (defvar efs/default-font-size 200)
    (defvar efs/default-variable-font-size 250)

    (setq inhibit-startup-message t)

    (scroll-bar-mode -1) ;disable visible scrollbar
    (tool-bar-mode -1)   ;disable toolbar
    (tooltip-mode -1)    ;disable tooltips
    (set-fringe-mode 10) ;give some breathing room

    (menu-bar-mode -1)   ;disable the munu bar

    ;; set up the visible bell
    (setq visible-bell t)

    ;; display line numbers
    (column-number-mode)
    (global-display-line-numbers-mode t)

    ;; Disable line numbers for some modes
    (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  vterm-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook
                  pdf-view-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

    ;; parenthesis completion
    (electric-pair-mode 1)

#+end_src

** Font configuration

#+begin_src emacs-lisp

    ;; Font Configuration ------------------------------------------------------

    (set-face-attribute 'default nil :font "Fira Code" :height efs/default-font-size)

    ;; Set the fixed pitch face
    (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height efs/default-font-size)
    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil :font "LXGW WenKai" :height efs/default-variable-font-size :weight 'regular)
    (setq all-the-icons-dired-monochrome nil)  ;; 关闭单色图标模式,在文件系统中看起来更好

    ;; 中文字体设置
    ;(dolist (charset '(kana han symbol cjk-misc bopomofo))
    ;  (set-fontset-font (frame-parameter nil 'font)
    ;charset
    ;                    (font-spec :family "Microsoft YaHei UI" :size 25)))

    ;; to check if some font match, use following code

    ;(dolist (font (font-family-list))
    ;  (when (string-match "sans" font)
    ;    (message "Found font: %s" font)))

#+end_src


** safe theme

if failed to load doom-theme, use this theme instead

#+begin_src emacs-lisp

  (load-theme 'wombat)

#+end_src

* Package Loading Configuration

#+begin_src emacs-lisp

  ;; package loading configuration

  ;; initialize package
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

  ;; disable verify signiture
  ;; because gpg can't work
  (setq package-check-signature nil)

#+end_src

* UI Configuration
** ivy & counsel

#+begin_src emacs-lisp

  ;; show the options while hit C-x ...
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package counsel
      :config
      (counsel-mode 1))

#+end_src

** Ivy-rich

provide more doc and information after a command

#+begin_src emacs-lisp

  ;; provide more doc after command
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

#+end_src

** Icons

#+begin_src emacs-lisp

  ;;icon
  ;; NOTE: The first time you load your configuration on a new machine, you'll
  ;; need to run the following command interactively so that mode line icons
  ;; display correctly:
  ;;
  ;; M-x all-the-icons-install-fonts
  ;; M-x nerd-icons-install-fonts

  (use-package all-the-icons
    :if (display-graphic-p))

#+end_src

** doom-theme

#+begin_src emacs-lisp

  ;;theme
  (use-package doom-themes
    :init (load-theme 'doom-moonlight t))

#+end_src

** transparency

#+begin_src emacs-lisp
  ;; Set transparency of emacs
  ;(defun transparency (value)
  ;  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  ;  (interactive "nTransparency Value 0 - 100 opaque:")
  ;  (set-frame-parameter (selected-frame) 'alpha value))

  (set-frame-parameter nil 'alpha-background 60)

  (add-to-list 'default-frame-alist '(alpha-background . 60))

#+end_src

** doom-modeline

#+begin_src emacs-lisp

  ;;doom-modeline
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))

#+end_src

** which key

prompt some information while hiting C-h

#+begin_src emacs-lisp

  ;; which key
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src

** helpful

A helpful help page, add source code and command in it

#+begin_src emacs-lisp

  ;; make help more helpful, add source code and some command in
  ;; help doc
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* Key Bindings
** general

easier way to config keybindings

In evil mode, press <SPC>, other mode, hit C-SPC

then t for toggle (aka. change), tt: choose theme

#+begin_src emacs-lisp

  ;; config keybindings more convenient
  (use-package general
    :config
    ;; rune/leader-keys is a variable (user difined var)
    (general-create-definer rune/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
  ;; t for toggle (change)
    (rune/leader-keys
      "s"  '(:ignore t :which-key "scale-switch")
      "st" '(counsel-load-theme :which-key "switch theme")))

#+end_src

** hydra

A way to bind key quickly, here is an example of binding text scaling

Notice that rune/leader-keys is the function we defined in general package

#+begin_src emacs-lisp

  (use-package hydra)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (rune/leader-keys
    "ss" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

** evil!

vim in emacs

#+begin_src emacs-lisp

  ;; evil
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    ; use C-g to go to normal mode
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

#+end_src

** "jk" to normal

#+begin_src emacs-lisp

  ;; key-chord: allow press two key quickly to get a command
  (use-package key-chord
    :ensure t
    :config
    (key-chord-mode 1))

  ;; set delay
  (setq key-chord-tow-keys-delay 0.5)

  ;;  'jk' to normal mode
  (key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
  
#+end_src

** evil-collection

disable evil in some mode

#+begin_src emacs-lisp

  ;; disable evil and use emacs keybindings in some mode
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

* Dev
** commands
*** Basic Completions

- *completion-at-point* for completions

*** Find Definitions and References

C-c l g r / M-x lsp-findreferences : find the references in different file

C-c l g g / M-x lsp-find-definition : find the definition

*** Rename Symbol

C-c l r r / M-x lsp-rename : rename the variable

*** Diagnostics

M-x flymake-show-diagnostics-buffer : show diagnostics

*** Formatting

M-x lsp-format-buffer / C-c l = = : format the buffer

*** Find References

M-x lsp-ui-peek-find references / C-c l G r : quick show the references in different files

** flycheck
#+begin_src emacs-lisp

  (use-package flycheck
    :ensure t
    :config
    (setq truncate-lines nil) ; 如果单行信息很长会自动换行
    :hook
    (prog-mode . flycheck-mode))

#+end_src

** IDE Features with lsp-mode
