init.el

;; giving a hierarchy in a file
(defun efs/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

;; lsp mode
(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . efs/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-, l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t)
  )

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-flycheck-enable t)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package treemacs
  :ensure t
  :defer t
  :config
  (treemacs-tag-follow-mode)
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ;; ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag))
  (:map treemacs-mode-map
        ("/" . treemacs-advanced-helpful-hydra)))

(use-package treemacs-projectile
  :ensure t
  :after (treemacs projectile))

(use-package lsp-treemacs
  :ensure t
  :after (treemacs lsp))

(use-package lsp-ivy)

(use-package dap-mode
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
                                        ;:custom
  :custom
  (dap-auto-configure-features '(locals expressions controls))
  (setq lsp-enable-dap-auto-configure t)
  :config
  (dap-ui-mode 1)
  (setq dap-auto-show-output 1)

  :config
  ;; Set up Node debugging
  (require 'dap-node)
  (dap-node-setup) ;; Automatically installs Node debug adapter if needed
  ;; Set up GDB
  (require 'dap-gdb-lldb)
  (dap-gdb-lldb-setup)

  (require 'dap-python)
  (setq dap-python-debugger 'debugpy)
  ;; Bind `, l d` to `dap-hydra` for easy access
  (general-def
    :prefix ","
    :states 'motion
    :keymaps 'lsp-mode-map
    ;; dap
    "d" '(nil :which-key "dap")
    "dr" '(dap-debug :which-key "debug")
    "di" '(dap-breakpoint-add :which-key "add breakpoint")
    "dd" '(dap-breakpoint-delete :which-key "delete breakpoint")
    "dD" '(dap-breakpoint-delete-all :which-key "delete all breakpoints")
    "dc" '(dap-breakpoint-condition :which-key "condition")
    "dh" '(dap-hydra t :wk "helpper map"))
  ;(general-define-key
  ; :keymaps 'lsp-mode-map
  ; :prefix lsp-keymap-prefix
  ; "d" '(dap-hydra t :wk "debugger"))
  )

(defun file-name-only ()
  "Get the current buffer file name without directory."
  (file-name-nondirectory (buffer-name)))

(defun file-name-only-noext ()
  "Get the currennt buffer file name without directory and extension."
  (file-name-sans-extension (file-name-only)))

;; set compile command
;; if want to change, "M-x add-dir-local-variable" add edit dir-locals.el
;;(c++-mode . ((compile-command . (concat "g++ -g "
;;                                        (file-name-only)
;;                                         " -o "
;;                                        (file-name-only-noext)))))

(defun compile-cpp-file ()
  (interactive)
  (let* ((compile-command (format "g++ %s -g -o %s" (file-name-only) (file-name-only-noext))))

    (shell-command compile-command "*compilation*")))

(defun compile-and-run-cpp-file ()
  (interactive)
  (let* ((compile-command (format "g++ %s -g -o %s" (file-name-only) (file-name-only-noext)))
         (run-command (format "./%s" (file-name-only-noext))))

    (shell-command compile-command "*compilation*")
    (async-shell-command run-command "*cpp-output*")))

(defun compile-c-file ()
  (interactive)
  (let* ((compile-command (format "gcc %s -g -o %s" (file-name-only) (file-name-only-noext))))

    (shell-command compile-command)))

(defun compile-and-run-c-file ()
  (interactive)
  (let* ((compile-command (format "gcc %s -g -o %s" (file-name-only) (file-name-only-noext)))
         (run-command (format "./%s" (file-name-only-noext))))

    (shell-command compile-command "*compilation*")
    (async-shell-command run-command "*c-output*")))

(use-package cc-mode
  :ensure nil
  :functions 			; suppress warnings
  c-toggle-hungry-state
  :hook
  (c-mode . lsp-deferred)
  (c++-mode . lsp-deferred)
  (c++-mode . c-toggle-hungry-state))

(general-def
  :prefix ","
  :states 'motion
  :keymaps 'c-mode-map
  "l" '(:keymap lsp-command-map :which-key "lsp")
  ;; dap
  "d" '(nil :which-key "dap")
  "dr" '(dap-debug :which-key "debug")
  "di" '(dap-breakpoint-add :which-key "add breakpoint")
  "dd" '(dap-breakpoint-delete :which-key "delete breakpoint")
  "dD" '(dap-breakpoint-delete-all :which-key "delete all breakpoints")
  "dc" '(dap-breakpoint-condition :which-key "condition")
  ;;c mode custom
  "c" '(nil :which-key "compile")
  "cs" '(compile-c-file :which-key "simple compile")
  "cr" '(compile-and-run-c-file :which-key "compile and run"))

(general-def
  :prefix ","
  :states 'motion
  :keymaps 'c++-mode-map
  "l" '(:keymap lsp-command-map :which-key "lsp")
  ;; dap
  "d" '(nil :which-key "dap")
  "dr" '(dap-debug :which-key "debug")
  "di" '(dap-breakpoint-add :which-key "add breakpoint")
  "dd" '(dap-breakpoint-delete :which-key "delete breakpoint")
  "dD" '(dap-breakpoint-delete-all :which-key "delete all breakpoints")
  "dc" '(dap-breakpoint-condition :which-key "condition")
  ;; cpp mode custom
  "c" '(nil :which-key "compile")
  "cs" '(compile-cpp-file :which-key "simple compile")
  "cr" '(compile-and-run-cpp-file :which-key "compile and run"))

(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
