utilFiles/initFiles/init.org
**** basic configure

#+begin_src emacs-lisp
  (use-package python-mode
    :ensure t
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    (python-shell-interpreter "python3")
    (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))


  (use-package pyvenv
    :ensure t
    :config
    (setenv "WORKON_HOME" (expand-file-name "~/anaconda3/envs"))
    (pyvenv-mode t))

    ;  (use-package pyvenv
    ;    :ensure t
    ;    :config
    ;    (setenv "WORKON_HOME" (expand-file-name "d:/dev/anaconda/envs"))
        ;; (setq python-shell-interpreter "python3")  ; （可选）更改解释器名字
    ;    (pyvenv-mode t)
        ;; （可选）如果希望启动后激活 anaconda 的 base 环境，就使用如下的 hook
                                              ;:hook
                                              ;(python-mode . (lambda () (pyvenv-workon "..")))
    ;    )

    ;  (defun my-pyvenv-workon-hook ()
    ;    "Restart lsp and update Flycheck when switching Python virtual environments."
        ;; Restart lsp-mode
    ;    (when (bound-and-true-p lsp-mode)
    ;      (lsp-restart-workspace))

        ;; Update Flycheck executables
    ;    (setq-local flycheck-python-pycompile-executable (executable-find "python"))
    ;    (setq-local flycheck-python-pyright-executable (executable-find "pyright"))
    ;    (setq-local flycheck-python-flake8-executable (executable-find "flake8"))
    ;    (setq-local flycheck-python-pylint-executable (executable-find "pylint"))

        ;; Restart Flycheck to use the new executables
    ;    (flycheck-buffer))

    ;  (add-hook 'pyvenv-post-activate-hooks 'my-pyvenv-workon-hook)

#+end_src

**** lsp configure

run command: *npm install -g pyright* to install pyright


#+begin_src emacs-lisp

   (use-package lsp-pyright
     :ensure t
     :hook
     (python-mode . (lambda ()
                     (require 'lsp-pyright)
                     (lsp-deferred))))
#+end_src

*** java
**** language server
#+begin_src emacs-lisp
  (use-package lsp-java
    :config
    (add-hook 'java-mode-hook 'lsp))
#+end_src
**** colorful junit test
#+begin_src emacs-lisp
  (add-hook 'compilation-filter-hook
            (lambda () (ansi-color-apply-on-region (point-min) (point-max))))
#+end_src
**** debug usage
#+begin_src emacs-lisp
    (use-package dap-java
      :ensure nil)
#+end_src

**** key binding
#+begin_src emacs-lisp
  (general-def
    :prefix ","
    :states 'motion
    :keymaps 'java-mode-map
    ;; lsp
    "l" '(:keymap lsp-command-map :which-key "lsp")
    ;; dap
    "d" '(nil :which-key "dap")
    "dr" '(dap-debug :which-key "debug")
    "di" '(dap-breakpoint-add :which-key "add breakpoint")
    "dd" '(dap-breakpoint-delete :which-key "delete breakpoint")
    "dD" '(dap-breakpoint-delete-all :which-key "delete all breakpoints")
    "dc" '(dap-breakpoint-condition :which-key "condition")
    ;; test
    "t" '(nil :which-key "test")
    "tc" '(dap-java-run-test-class :which-key "run class")
    "tm" '(dap-java-run-test-method :which-key "run method")
    "tl" '(dap-java-run-last-test :which-key "run last")
    "tM" '(dap-java-debug-test-method :which-key "debug method")
    "tC" '(dap-java-debug-test-class :which-key "debug class"))
#+end_src
*** ros/ros2
#+begin_src emacs-lisp
  (use-package ros
    :ensure t
    :config
    (setq ros-workspaces
          (list
           (ros-dump-workspace :tramp-prefix nil :workspace "~/codes/rosWorkspace/tutorial_ws" :extends '("/opt/ros/humble/")))
          )
    )
#+end_src
** Commenting

use C-/ to comment the lines

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("C-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Company Mode

nicer in-buffer completion interface than completion-at-point

bind <tab> to complete

use company-box to further enhance the look of the completions with icons and better overall presentation

#+begin_src emacs-lisp

    ;;   (use-package company
    ;;     :ensure t
    ;;     :after lsp-mode
    ;;     :hook (lsp-mode . company-mode)
    ;;     :bind (:map company-active-map
    ;;                   ("<tab>" . company-complete-selection))
    ;;       (:map lsp-mode-map
    ;;             ("<tab>" . company-indent-or-complete-common))
    ;;       :custom
    ;;       (company-minimum-prefix-length 1)
    ;;       (company-idle-delay 0.0)
    ;;       (company-show-numbers t) ; M-1, M-2 ... to select the card
    ;;       (company-selection-wrap-around t)
    ;;       (company-transformers '(company-sort-by-occurrence))) ; frequency sort

     (use-package company
       :diminish company-mode
       :general
       (general-define-key :keymaps 'company-active-map
                           "C-j" 'company-select-next
                           "C-k" 'company-select-previous)
       :bind (:map company-active-map
                   ("<tab>" . company-complete-selection))
       (:map lsp-mode-map
             ("<tab>" . company-indent-or-complete-common))
       :init
       ;; These configurations come from Doom Emacs:
       (add-hook 'after-init-hook 'global-company-mode)
       (setq company-minimum-prefix-length 1
             company-tooltip-limit 14
             company-tooltip-align-annotations t
             company-require-match 'never
             company-global-modes '(not erc-mode message-mode help-mode gud-mode)
             company-frontends
             '(company-pseudo-tooltip-frontend  ; always show candidates in overlay tooltip
               company-echo-metadata-frontend)  ; show selected candidate docs in echo area
             company-backends '(company-capf company-files company-keywords)
             company-auto-complete nil
             company-auto-complete-chars nil
             company-dabbrev-other-buffers nil
             company-dabbrev-ignore-case nil
             company-dabbrev-downcase nil)

       :custom
       (company-show-numbers t)
       (company-selection-wrap-around t)
       (company-transformers '(company-sort-by-occurrence))
       (company-idle-delay 0.0))

    (use-package company-box
        :ensure t
        :if window-system
        :hook (company-mode . company-box-mode))

#+end_src

** Yasnippet (codes shortcuts)
#+begin_src emacs-lisp

;(use-package yasnippet
;  :ensure t)
;(yas-global-mode 1)
;(add-hook 'yas-minor-mode-hook (lambda () (yas-activate-extra-mode 'fundamental-mode)))

;(use-package yasnippet-snippets
;    :ensure t
;    :after yasnippet)
    
#+end_src>

** rainbow bracket

#+begin_src emacs-lisp

  ;; rainbow bracket
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** projectile

check a dir with .git as a project in the specific path

#+begin_src emacs-lisp

  ;; projectile
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    ;; make profectile command bind to ivy
    :custom ((projectile-completion-system 'ivy))
    ;; C-c p to use projectile command
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    
    ;; NOTE: Set this to the folder where you keep your Git repos!
    ;; in my case: d:/codes/projects
    
    (when (file-directory-p "~/projects")
      (setq projectile-project-search-path '("~/projects")))
    (setq projectile-switch-project-action #'projectile-dired))

#+end_src

** magit

#+begin_src emacs-lisp

  ;; magit
  ;; set the git path, or emacs can not find git

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; evil-magit has merged into magit, we don't need it anymore!

  ;(use-package evil-magit
    ;:after magit)

#+end_src

** force

A package to deal with github, I think i don't need it for a while

#+begin_src emacs-lisp

  ;; I think I don't need it for while
  ;; for future using, use it to manage github related things

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  ;(use-package forge)

#+end_src

** Long Line related
#+begin_src emacs-lisp
(setq-default bidi-paragraph-direction 'left-to-right)
#+end_src
* Terminals
** term-mode

- =C-c C-p= / =C-c C-n= : go back and forward in the buffer's prompts(also "[[" and  back parenthesis in evil mode)
- =C-c C-k= : Enter char-mode
- =C-c C-j= : Return to line-mode

  to open multiple term, use =rename-uniquely= to rename the term buffer

#+begin_src emacs-lisp

  (use-package term
    :config
    (setq explicit-shell-file-name "bash") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args

    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
  
#+end_src

