utilFiles/initFiles/init.org
** Better term-mode colors

#+begin_src emacs-lisp

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

#+end_src

** ansi term

M-x ansi-term : multi teminal

** vterm

faster term (use local compiler not elisp)

#+begin_src emacs-lisp
(use-package vterm
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
  ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
  (setq vterm-max-scrollback 10000))
#+end_src

** eshell

redirect the output into a buffer:  =echo "hello!" > #<buffer test-buffer>=

#+begin_src emacs-lisp
(defun efs/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt)

(use-package eshell
  :hook (eshell-first-time-mode . efs/configure-eshell)
  :config

  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))

  (eshell-git-prompt-use-theme 'powerline))
#+end_src

* File Management
** Dired

Dired is a built-in file manager for Emacs that does some pretty amazing things! Here are some key bindings you should try out:

*** Key Bindings
**** Navigation
***** Emacs / Evil

        - n / j - next line
        - p / k - previous line
        - j / J - jump to file in buffer
        - RET - select file or directory
        - ^ - go to parent directory
        - S-RET / g O - Open file in “other” window
        - M-RET - Show file in other window without focusing (previewing files)
        - g o (dired-view-file) - Open file but in a “preview” mode, close with q
        - g / g r Refresh the buffer with revert-buffer after changing configuration (and after filesystem changes!)

**** Marking files
        - m - Marks a file
        - u - Unmarks a file
        - U - Unmarks all files in buffer
        - * t / t - Inverts marked files in buffer
        % m - Mark files in buffer using regular expression
        - * - Lots of other auto-marking functions
        - k / K - “Kill” marked items (refresh buffer with g / g r to get them back)
        Many operations can be done on a single file if there are no active marks!

**** Copying and Renaming files
- C-x C-q : use evil normal mode to edit the name and press *Z-Z*
- C - Copy marked files (or if no files are marked, the current file)
  Copying single and multiple files
- U - Unmark all files in buffer
- R - Rename marked files, renaming multiple is a move!
- % R - Rename based on regular expression: ^test , old-\&
- Power command: C-x C-q (dired-toggle-read-only) - Makes all file names in the buffer editable directly to rename them! Press Z Z to confirm renaming or Z Q to abort.

**** Deleting files
- D - Delete marked file
- d - Mark file for deletion
- x - Execute deletion for marks
- delete-by-moving-to-trash - Move to trash instead of deleting permanently
**** Creating and extracting archives
- Z - Compress or uncompress a file or folder to (.tar.gz)
- c - Compress selection to a specific file
- dired-compress-files-alist - Bind compression commands to file extension
**** Other common operations
- T - Touch (change timestamp)
- M - Change file mode
- O - Change file owner
- G - Change file group
- S - Create a symbolic link to this file
- L - Load an Emacs Lisp file into Emacs

#+begin_src emacs-lisp

  ;; (use-package dired-single)
  ;; (require 'dired-single)

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (put 'dired-find-alternate-file 'disabled nil)
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" (lambda () (interactive) (find-alternate-file ".."))
      "l" 'dired-find-alternate-file)
    ;; (evil-collection-define-key 'normal 'dired-mode-map
    ;;   "h" (lambda()(interactive)(find-alternate-file ".."))
    ;;   "l" dired-find-alternate-file
    ;;   ;; "h" 'dired-single-up-directory
    ;;   ;; "l" 'dired-single-buffer
    ;;   )
    )

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :config
    ;; Doesn't work as expected!
    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))

  ;; "H" to load dot files
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

#+end_src
* Keep Folders Clean
** back up files

keep those file in =~/.emacs.c/tmp/backups=

#+begin_src emacs-lisp
  
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

#+end_src

** auto-save files

put those files into =~/.emacs.d/tmp/auto-saves/=

#+begin_src emacs-lisp

  ;; auto-save-mode doesn't create the path automatically!
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

#+end_src

* Window Management

** Ace-window

fast moving to different windows

set aw-keys to home keys , you don't need to get out of the home line


#+begin_src emacs-lisp
  (use-package ace-window
    :ensure t
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :bind (("C-x o" . 'ace-window)))
#+end_src

** Edwina

*** setup

Offer an automatically window management for master window and stack window

#+begin_src emacs-lisp

;   (use-package edwina
;     :ensure t
;     :config
;     (setq display-buffer-base-action '(display-buffer-below-selected))
     ;; (edwina-setup-dwm-keys)
;     (edwina-mode 1))

#+end_src

*** Keybindings

By default these keys are prefixed with =C-c C-w=. Customize =edwina-keymap-prefix= to change the prefix.

|-------------------+--------------------------------------|
| Binding           | Action                               |
|-------------------+--------------------------------------|
| =r=, =C-r=        | Arrange windows                      |
| =n=, =C-n=, =SPC= | Move to next window                  |
| =p=, =C-p=        | Move to previous window              |
| =N=, =C-S-n=      | Swap places with the next window     |
| =P=, =C-S-p=      | Swap places with the previous window |
| =%=, ={=, =[=     | Decrease the size of the master area |
| =^=, =}=, =]=     | Increase the size of the master area |
| =d=, =C-d=        | Decrease number of windows in master |
| =i=               | Increase number of windows in master |
| =k=, =C-k=        | Delete window                        |
| =RET=             | Cycle window to/from master area     |
| =c=, =C-c=        | Clone current window                 |
|-------------------+--------------------------------------|
|                   |                                      |

** Winner mode

window manage undo and redo

bind =C-w u= and =C-w U= to undo and redo

 =C-c left= =C-c right= to undo redo 

#+begin_src emacs-lisp

(use-package winner-mode
  :ensure nil
  :bind (:map evil-window-map
         ("u" . winner-undo)
         ("U" . winner-redo))
  :config
  (winner-mode))

#+end_src

** Golden-ratio

#+begin_src emacs-lisp
  ;(use-package golden-ratio
  ;  :ensure t
  ;  :config
  ;  (golden-ratio-mode 1))
#+end_src
* Org Mode
** font set up


#+begin_src emacs-lisp
  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "LXGW WenKai" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src

** Basic Set up


#+begin_src emacs-lisp

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

#+end_src

