init.el



(use-package org-roam
  :ensure t
  :custom
  (org-roam-directory "~/RoamNotes")
  (org-roam-completion-everywhere t)

  (org-roam-capture-templates
 '(("d" "default" plain
    "%?"
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed t)

   ;; notes menu
   ("n" "notes")

   ("no" "notes overview" plain
    (file "~/RoamNotes/Templates/noteOverview.org")
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed t)

   ("nc" "course notes" plain
    (file "~/RoamNotes/Templates/courseNote.org")
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed T)

   ("nh" "chapter notes" plain
    (file "~/RoamNotes/Templates/chapterNote.org")
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed T)

   ("nk" "little knowledge" plain
    (file "~/RoamNotes/Templates/knowledgeNote.org")
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed T)

   ;; work menu
   ;; create stuff in tmp.org, and then refile it into work.org
   ;; notice that in this way will not create id
   ("w" "Work Todo Entries")


   ("we" "No Time" entry
    "** %^{Type|HW|READ|TODO|PROJ} ${title} %?" :prepend t :empty-lines-before 0
    :target (file "~/RoamNotes/Archive/tmp.org")
    :refile-targets (("~/RoamNotes/Archive/work.org" :maxlevel . 2)))

   ("ws" "Scheduled" entry
    "** %^{Type|HW|READ|TODO|PROJ} ${title}\nSCHEDULED: %^t%?" :prepend t :empty-lines-before 0
    :target (file "~/RoamNotes/Archive/tmp.org")
    :refile-targets (("~/RoamNotes/Archive/work.org" :maxlevel . 2)))

   ("wd" "Deadline" entry 
    "** %^{Type|HW|READ|TODO|PROJ} ${title}\nDEADLINE: %^t%?" :prepend t :empty-lines-before 0
    :target (file "~/RoamNotes/Archive/tmp.org")
    :refile-targets (("~/RoamNotes/Archive/work.org" :maxlevel . 2)))

   ("ww" "Scheduled & deadline" entry
    "** %^{Type|HW|READ|TODO|PROJ} ${title}\nSCHEDULED: %^t DEADLINE: %^t %?" :prepend t :empty-lines-before 0
    :target (file "~/RoamNotes/Archive/tmp.org")
    :refile-targets (("~/RoamNotes/Archive/work.org" :maxlevel . 2)))

   ))

  (org-roam-dailies-capture-templates
  '(("d" "default" entry "* %<%I:%M %p>: %?"
     :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))

   ("w" "Work Todo Entries")

   ("we" "No Time" entry
    "* %^{Type|HW|READ|TODO|PROJ} %^{todo} %?"
    :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))

   ("ws" "Scheduled" entry
    "* %^{Type|HW|READ|TODO|PROJ} %^{todo}\nSCHEDULED: %^t%?"
    :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))

   ("wd" "Deadline" entry 
    "* %^{Type|HW|READ|TODO|PROJ} %^{todo}\nDEADLINE: %^t%?"
    :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))

   ("ww" "Scheduled & deadline" entry
    "* %^{Type|HW|READ|TODO|PROJ} %^{todo}\nSCHEDULED: %^t DEADLINE: %^t %?"
    :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))
    ))


  :bind (:map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (require 'org-roam-dailies)
  (org-roam-setup)
  (org-roam-db-autosync-mode))

;; integrate with general key, <spc> is the prefix
(rune/leader-keys
  "o"  '(:ignore t :which-key "org roam")
  "ol" '(org-roam-buffer-toggle :which-key "backlinks-buffer")
  "of" '(org-roam-node-find :which-key "find-node")
  "oi" '(org-roam-node-insert :which-key "insert-node")
  "oc" '(org-id-get-create :which-key "create-id")
  "oa" '(org-roam-alias-add :which-key "add-alias")
  "od" '(:ignore t :which-key "dailies")
  "od." '(org-roam-dailies-find-directory :which-key "daily dir")
  "odh" '(org-roam-dailies-goto-previous-note :which-key "goto-previous")
  "odl" '(org-roam-dailies-goto-next-note :which-key "goto-next")
  "odD" '(org-roam-dailies-goto-today :which-key "goto-today")
  "odY" '(org-roam-dailies-goto-yesterday :which-key "goto-yesterday")
  "odT" '(org-roam-dailies-goto-tomorrow :which-key "goto-tomorrow")
  "odS" '(org-roam-dailies-goto-date :which-key "goto-date")
  "odd" '(org-roam-dailies-capture-today :which-key "capture-today")
  "ody" '(org-roam-dailies-capture-yesterday :which-key "capture-yesterday")
  "odt" '(org-roam-dailies-capture-tomorrow :which-key "capture-tomorrow")
  "ods" '(org-roam-dailies-capture-date :which-key "capture-date")
  )

(add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-side-window)
               (side . right)
               (slot . 0)
               (window-width . 0.33)
               (window-parameters . ((no-other-window . t)
                                     (no-delete-other-windows . t)))))

(use-package org-noter
  :ensure t
  :config
  (org-noter-enable-org-roam-integration)
  (setq org-noter-always-create-frame nil)
  )

(rune/leader-keys
  "on"  '(:ignore t :which-key "org-noter")
  "onn" '(org-noter :which-key "open-noter")
  "onk" '(org-noter-kill-session :which-key "kill-session"))

(use-package org-download
  :ensure t
  :config
  (add-hook 'dired-mode-hook 'org-download-enable)
  (setq-default org-download-image-dir "~/Pictures/org-download"))

;;auto display the image when open a org file
(add-hook 'org-mode-hook (lambda () (org-display-inline-images t)))

(use-package pdf-tools
  :defer t
  :mode  ("\\.pdf\\'" . pdf-view-mode)
  :config
  (pdf-loader-install)
  (setq-default pdf-view-display-size 'fit-height)
  (setq pdf-view-continuous nil) ;; Makes it so scrolling down to the bottom/top of a page doesn't switch to the next page
  ;(setq pdf-view-midnight-colors '("#ffffff" . "#121212" )) ;; I use midnight mode as dark mode, dark mode doesn't seem to work
  :general
  ;; Unbind SPC key in pdf-view-mode to avoid conflicts with general
  (general-define-key :states 'motion :keymaps 'pdf-view-mode-map
                      "C-j" 'pdf-view-next-page
                      "C-k" 'pdf-view-previous-page

                      "j" 'pdf-view-next-line-or-next-page
                      "k" 'pdf-view-previous-line-or-previous-page

                      ;; Arrows for movement as well
                      (kbd "<down>") 'pdf-view-next-line-or-next-page
                      (kbd "<up>") 'pdf-view-previous-line-or-previous-page

                      (kbd "<down>") 'pdf-view-next-line-or-next-page
                      (kbd "<up>") 'pdf-view-previous-line-or-previous-page

                      (kbd "<left>") 'image-backward-hscroll
                      (kbd "<right>") 'image-forward-hscroll

                      "H" 'pdf-view-fit-height-to-window
                      "W" 'pdf-view-fit-width-to-window
                      "=" 'pdf-view-enlarge
                      "-" 'pdf-view-shrink

                      "q" 'quit-window
                      "Q" 'kill-this-buffer
                      "g" 'revert-buffer

                      "C-s" 'isearch-forward
                      )
  )

(use-package go-translate
  :ensure t
  :config
  (setq gt-langs '(en zh))
  (setq gt-default-translator (gt-translator :engines (gt-youdao-dict-engine))))

(rune/leader-keys
  "l" '(gt-do-translate :which-key "translation"))

(use-package leetcode
  :ensure t
  :config
  (setq leetcode-save-solutions t)
  (setq leetcode-directory "~/codes/leetcode")
  (setq leetcode-prefer-language "cpp"))
