utilFiles/initFiles/init.org
** tab bar face config
#+begin_src emacs-lisp
    ;; tab bar background
    (set-face-attribute 'tab-bar nil
                        :foreground "#1fab89")

    ;; active tab
    (set-face-attribute 'tab-bar-tab nil
                        :foreground "#d7fbe8")

    ;; inactive tab
    (set-face-attribute 'tab-bar-tab-inactive nil
                        :foreground "#62d2a2")
#+end_src
** tab bar config
#+begin_src emacs-lisp
  (use-package tab-bar
    :hook (window-setup . tab-bar-mode)
    :init
    (setq tab-bar-emoji "💻 ")

    ;; 修改 tab-bar-format，去掉 menu-bar
    (setq tab-bar-format
          '(tab-bar-format-emoji tab-bar-format-tabs))

  ;; 自定义函数来插入 emoji
    (defun tab-bar-format-emoji ()
      (propertize tab-bar-emoji 'face '(:height 1.1)))
    :config
    (setq tab-bar-separator ""
          tab-bar-show 1  ;; hide bar if less than 1 tabs open
          tab-bar-new-tab-choice "*scratch*"
          tab-bar-tab-name-truncated-max 20
          tab-bar-auto-width nil
          tab-bar-close-button-show nil
          tab-bar-new-button-show nil
          tab-bar-tab-hints t)
    ;; menu bar

    ;; 自动截取 tab name，并且添加在每个 tab 上添加数字，方便用快捷键切换
    (setq tab-bar-tab-name-function
          (lambda () (let* ((raw-tab-name (buffer-name (window-buffer (minibuffer-selected-window))))
                       (count (length (window-list-1 nil 'nomini)))
                       (truncated-tab-name (if (< (length raw-tab-name)
                                                  tab-bar-tab-name-truncated-max)
                                               raw-tab-name
                                             (truncate-string-to-width raw-tab-name
                                                                       tab-bar-tab-name-truncated-max
                                                                       nil nil tab-bar-tab-name-ellipsis))))
                  (if (> count 1)
                      (concat truncated-tab-name "(" (number-to-string count) ")")
                    truncated-tab-name))))

    ;; 给 tab 两边加上空格，更好看
    (setq tab-bar-tab-name-format-function
          (lambda (tab i)
            (let ((face (funcall tab-bar-tab-face-function tab)))
              (concat
               (propertize " " 'face face)
               (propertize (number-to-string i) 'face `(:inherit ,face :weight ultra-bold :underline t))
               (propertize (concat " " (alist-get 'name tab) " ") 'face face)))))

    ;; 我把 meow 的 indicator 也放在 tab-bar 上
    ;(setq tab-bar-format '(meow-indicator  tab-bar-format-tabs))
    (tab-bar--update-tab-bar-lines)

    ;; WORKAROUND: update tab-bar for daemon
    ;; (when (daemonp)
    ;;   (add-hook 'after-make-frame-functions
    ;;             #'(lambda (&rest _) (force-mode-line-update))))
    )
#+end_src

** tab bar key bindings
#+begin_src emacs-lisp
  (rune/leader-keys
    "t" '(:ignore t :which-key "tab-bar")
    "th" '(tab-bar-switch-to-prev-tab :which-key "prev-tab") 
    "tl" '(tab-bar-switch-to-next-tab :which-key "next-tab") 
    "ti" '(tab-bar-new-tab :which-key "insert-new-tab") 
    "ts" '(tab-bar-select-tab-by-name :which-key "select-tab")
    "td" '(tab-bar-close-tab :which-key "close-tab")
    )
#+end_src

* eaf related
#+begin_src emacs-lisp
        ;; (use-package eaf
        ;;   :load-path "~/.emacs.d/site-lisp/emacs-application-framework"
        ;;   :custom
        ;;   ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
        ;;   (eaf-browser-continue-where-left-off t)
        ;;   (eaf-browser-enable-adblocker t)
        ;;   (browse-url-browser-function 'eaf-open-browser)
        ;;   :config
        ;;   (setq eaf-proxy-type "http")
        ;;   (setq eaf-proxy-host "127.0.0.1")
        ;;   (setq eaf-proxy-port "7897")
        ;;   (defalias 'browse-web #'eaf-open-browser)
        ;;   ;;(eaf-setup-leader-keys)
        ;;   ;;(eaf-bind-key take_photo "p" eaf-camera-keybinding)
        ;;   ;;(eaf-bind-key nil "M-q" eaf-browser-keybinding)

        ;;   (require 'eaf-browser)
        ;;   (require 'eaf-rss-reader)
        ;;   (require 'eaf-image-viewer)
        ;;   (require 'eaf-airshare)
        ;;   (require 'eaf-netease-cloud-music)
        ;;   (require 'eaf-demo)
        ;;   (require 'eaf-file-sender)
        ;;   (require 'eaf-js-video-player)
        ;;   ;;(require 'eaf-pdf-viewer)
        ;;   ;;(require 'eaf-git)
        ;;   (require 'eaf-terminal)
        ;;   ;;(require 'eaf-vue-demo)
        ;;   (require 'eaf-file-manager)
        ;;   ;;(require 'eaf-vue-tailwindcss)
        ;;   (require 'eaf-system-monitor)
        ;;   (require 'eaf-file-browser)
        ;;   (require 'eaf-jupyter)
        ;;   (require 'eaf-markdown-previewer)
        ;;   (require 'eaf-camera)
        ;;   (require 'eaf-markmap)
        ;;   ;;(require 'eaf-pyqterminal)
        ;;   (require 'eaf-video-player)
        ;;   (require 'eaf-music-player)
        ;;   (require 'eaf-map)
        ;;   (require 'eaf-mindmap)
        ;;   ;; key bindings and other
        ;;   (require 'eaf-evil)
        ;;   (require 'eaf-all-the-icons)
        ;;   ) ;; unbind, see more in the Wiki
#+end_src

* popweb
#+begin_src emacs-lisp
  ;; (defvar path-to-popweb "~/.emacs.d/pluginTools/popweb")
  ;; (use-package org-transclusion
  ;;   :ensure t)
  ;; (use-package popweb
  ;;   :load-path path-to-popweb
  ;;   :config
  ;;   (setq popweb-url-web-window-width-scale 1.5)
  ;;   (setq popweb-url-web-window-height-scale 1.5)
  ;;   ;; Org-Roam ID link and footnote link previewer
  ;;   (add-to-list 'load-path (concat path-to-popweb "/extension/org-roam"))
  ;;   (require 'popweb-org-roam-link)

  ;;   ;; LaTeX preview functionality
  ;;   (add-to-list 'load-path (concat path-to-popweb "/extension/latex"))
  ;;   (require 'popweb-latex)
  ;;   (add-hook 'latex-mode-hook #'popweb-latex-mode)
  ;;   (add-hook 'org-mode-hook #'popweb-latex-mode)

  ;;   ;; Chinese-English translation popup
  ;;   (add-to-list 'load-path (concat path-to-popweb "/extension/dict")) ;
  ;;   (require 'popweb-dict)

  ;;   ;; Anki note review popup
  ;;   (add-to-list 'load-path (concat path-to-popweb "/extension/anki-review"))
  ;;   (require 'popweb-anki-review)
  ;;   )

#+end_src

* Music
** lilypond
#+begin_src emacs-lisp
  ;; (autoload 'LilyPond-mode "lilypond-mode")
  ;; (setq auto-mode-alist
  ;;       (cons '("\\.ly$" . LilyPond-mode) auto-mode-alist))
  ;; (add-hook 'LilyPond-mode-hook (lambda () (turn-on-font-lock)))
  ;; (setq load-path (append (list (expand-file-name "/usr/share/emacs/site-lisp")) load-path))

#+end_src

* Org repetition system
#+begin_src emacs-lisp

  ;; (defvar path-to-org-srs "~/.emacs.d/pluginTools/org-srs")
  ;; (defvar path-to-fsrs "~/.emacs.d/pluginTools/fsrs")

  ;; (add-to-list 'load-path path-to-org-srs)
  ;; (add-to-list 'load-path path-to-fsrs)
  ;; (require 'fsrs)
  ;; (require 'org-srs)

#+end_src

* uniline
#+begin_src emacs-lisp
  (use-package uniline
    :ensure t)
#+end_src

* nix
#+begin_src emacs-lisp
(use-package nix-mode
  :ensure t
  :hook (nix-mode . lsp-deferred)
  :mode "\\.nix\\'")
#+end_src
